import 'package:flutter/material.dart';
import "package:ukraine_music/homepage.dart";

String text_indep = "Україна проголосила незалежність у 1991 році. Що в цей час відбувалося в музичному плані? З 1980-х існувала ідейна організація 'Рок-Артель', яка об’єднувала три основних гурти: ВВ (Воплі Відоплясова), Коллежский Асессор і Раббота Хо."
        "Два останніх грали доволі авангардні композиції, які дуже умовно можна було віднести до 'рок-музики', і радше тяжіли до експериментальної хвилі зарубіжних 60-х. Аудиторія в них була не дуже великою і складалася переважно з поціновувачів. А от ВВ дуже швидко віднайшли власний етно-панковий стиль — і в 90-х вирушили з концертами до Європи, де й залишилися на кілька років."
        "Мабуть, першою поп-зіркою незалежної України можна вважати співачку Русю (Ірину Осауленко). Цікаво, що музична кар’єра Ірини почалась наприкінці 80-х — майже одночасно з кар’єрою її молодшої сестри Наташі, яку широкий загал знає як Наташу Корольову. Виконавиця від самого початку обрала 'російський шлях', хоч і народилась у Києві."
        "А от Ірина познайомилася з талановитим продюсером Костянтином Осауленко, який згодом став її чоловіком. Він і придумав проєкт Руся: така собі українська Мадонна, дівчина у світлому одязі з солодким голосом, яка співає чистою українською мовою під бадьорі синтезаторні ритми. Розрахунки Костянтина виявились вірними — і Руся стала головною музичною сенсацією 1990 року. А в наступному році вже збирала стадіони й великі зали у столиці та під час туру Західною Україною. Руся одержала титул головної співачки року за версією Національного хіт-параду."
        "Далі починається історія кохання та співпраці співачки Ірини Білик і продюсера Юрія Нікітіна. Білик наприкінці 80-х виступає на 'Червоній руті' із гуртом 'Цей дощ надовго'.";

// хіт-парад 'Територія А'
String text_indep_two = "";

class Independence extends StatelessWidget {
  const Independence({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text("Незалежність"),
        backgroundColor: Colors.orangeAccent,
      ),
      body: Column(
        mainAxisAlignment: MainAxisAlignment.start,
        children: [
          Padding(
            padding: EdgeInsets.all(10),
            child: Text(text_indep),
          ),
          Row(
          mainAxisAlignment: MainAxisAlignment.center,
          children: [
            Padding(
              padding: EdgeInsets.all(10),
              child: Text("Хіт-парад 'Теорія А'"),
              ),
            ],
          ),
          Padding(
            padding: EdgeInsets.all(10),
            child: Text(text_indep_two),
          ),
        ],
      ),
      floatingActionButton: FloatingActionButton(
        onPressed: () {
          Navigator.of(context).push(
            MaterialPageRoute(
              builder: (context) => const Homepage(),
            ),
          );
        },
        backgroundColor: Colors.orangeAccent,
        child: Icon(Icons.home),

      ),
    );
  }
}
